name: "45degree_siamese_model_trainning"
layer {
  name: "img"
  type: "ImageData"
  top: "img"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625    
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
  }
  image_data_param {
    source: "/mnt/sda/backup/streetview45/pair_info/sla.info"
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
    new_height: 224
    new_width: 224
    batch_size: 32
  }
}
layer {
  name: "img_p"
  type: "ImageData"
  top: "img_p"
  top: "label_p"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625    
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
  }
  image_data_param {
    source: "/mnt/sda/backup/streetview45/pair_info/slp.info"
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
    new_height: 224
    new_width: 224
    batch_size: 32
  }
}
layer {
  name: "img"
  type: "ImageData"
  top: "img"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625    
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
  }
  image_data_param {
    source: "/mnt/sda/backup/streetview45/pair_info/slta.info"
    new_height: 224
    new_width: 224
    batch_size: 32
  }
}
layer {
  name: "img_p"
  type: "ImageData"
  top: "img_p"
  top: "label_p"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625    
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
  }
  image_data_param {
    source: "/mnt/sda/backup/streetview45/pair_info/sltp.info"
    mean_file: "/mnt/sda/backup/45degree/VGG_mean.binaryproto"
    new_height: 224
    new_width: 224
    batch_size: 32
  }
}
layer {
  bottom: "img"
  top: "conv1"
  name: "conv1"
  type: "Convolution"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "conv1"
  top: "conv1"
  name: "relu1"
  type: "ReLU"
}
layer {
  bottom: "conv1"
  top: "norm1"
  name: "norm1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  name: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2"
  name: "conv2"
  type: "Convolution"
    param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
  }
}
layer {
  bottom: "conv2"
  top: "conv2"
  name: "relu2"
  type: "ReLU"
}
layer {
  bottom: "conv2"
  top: "norm2"
  name: "norm2"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  type: "Convolution"
    param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3"
  top: "conv3"
  name: "relu3"
  type: "ReLU"
}
layer {
  bottom: "conv3"
  top: "conv4"
  name: "conv4"
  type: "Convolution"
    param {
    name: "conv4_w"
    lr_mult: 0
  }
  param {
    name: "conv4_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4"
  top: "conv4"
  name: "relu4"
  type: "ReLU"
}
layer {
  bottom: "conv4"
  top: "conv5"
  name: "conv5"
  type: "Convolution"
  param {
    name: "conv5_w"
    lr_mult: 0
  }
  param {
    name: "conv5_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5"
  top: "conv5"
  name: "relu5"
  type: "ReLU"
}
layer {
  bottom: "conv5"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"
  param {
    name: "fc6_w"
    lr_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"
  param {
    name: "fc7_w"
    lr_mult: 3
  }
  param {
    name: "fc7_b"
    lr_mult: 6
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "img_p"
  top: "conv1_p"
  name: "conv1_p"
  type: "Convolution"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "conv1_p"
  top: "conv1_p"
  name: "relu1_p"
  type: "ReLU"
}
layer {
  bottom: "conv1_p"
  top: "norm1_p"
  name: "norm1_p"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm1_p"
  top: "pool1_p"
  name: "pool1_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool1_p"
  top: "conv2_p"
  name: "conv2_p"
  type: "Convolution"
    param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
  }
}
layer {
  bottom: "conv2_p"
  top: "conv2_p"
  name: "relu2_p"
  type: "ReLU"
}
layer {
  bottom: "conv2_p"
  top: "norm2_p"
  name: "norm2_p"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm2_p"
  top: "pool2_p"
  name: "pool2_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2_p"
  top: "conv3_p"
  name: "conv3_p"
  type: "Convolution"
    param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_p"
  top: "conv3_p"
  name: "relu3_p"
  type: "ReLU"
}
layer {
  bottom: "conv3_p"
  top: "conv4_p"
  name: "conv4_p"
  type: "Convolution"
    param {
    name: "conv4_w"
    lr_mult: 0
  }
  param {
    name: "conv4_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_p"
  top: "conv4_p"
  name: "relu4_p"
  type: "ReLU"
}
layer {
  bottom: "conv4_p"
  top: "conv5_p"
  name: "conv5_p"
  type: "Convolution"
  param {
    name: "conv5_w"
    lr_mult: 0
  }
  param {
    name: "conv5_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_p"
  top: "conv5_p"
  name: "relu5_p"
  type: "ReLU"
}
layer {
  bottom: "conv5_p"
  top: "pool5_p"
  name: "pool5_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool5_p"
  top: "fc6_p"
  name: "fc6_p"
  type: "InnerProduct"
  param {
    name: "fc6_w"
    lr_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc6_p"
  top: "fc6_p"
  name: "relu6_p"
  type: "ReLU"
}
layer {
  bottom: "fc6_p"
  top: "fc6_p"
  name: "drop6_p"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6_p"
  top: "fc7_p"
  name: "fc7_p"
  type: "InnerProduct"
  param {
    name: "fc7_w"
    lr_mult: 3
  }
  param {
    name: "fc7_b"
    lr_mult: 6
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "loss"
  type: "ContrastiveLoss"
  bottom: "fc7"
  bottom: "fc7_p"
  bottom: "label"
  bottom: "label_p"
  top: "loss"
  contrastive_loss_param {
    margin: 1
  }
}
